Repository: demispatti/nicescrollr
Catalog: languages/nicescrollr-*.po
Languages: de_de

source: Plugin support
de_de: Plugin-Unterstützung

source: Rate plugin
de_de: Plugin bewerten

source: Donate
de_de: Spenden

source: Reset
de_de: Zurücksetzen

source: This resets the frontend view to it's defaults. Continue?
de_de: Die Frontend-Ansicht wird auf die Standardwerte zurückgesetzt. Möchten Sie fortfahren?

source: This resets the backend view to it's defaults. Continue?
de_de: Die Backend-Ansicht wird auf die Standardwerte zurückgesetzt. Möchten Sie fortfahren?

source: This resets the plugin to it's defaults. Continue?
de_de: Die Einstellungen des Plugins werden auf die Standardwerte zurückgesetzt. Möchten Sie fortfahren?

source: This resets all Nicescrollr settings to their defaults. Continue?
de_de: Alle Nicescrollr-Einstellungen werden auf die Standardwerte zurückgesetzt. Möchten Sie fortfahren?

source: cancel
de_de: abbrechen

source: That won't do.
de_de: Das geht nicht.

source: Please try again later.
de_de: Bitte versuchen Sie es später erneut.

source: Settings set to default.
de_de: Auf Standardeinstellungen zurückgesetzt.

source: HELP
de_de: HILFE

source: Nicescrollr help
de_de: Nicescrollr Hilfe

source: Nicescrollr integrates the Nicescroll jQuery library into your WordPress powered website.
de_de: Nicescrollr integriert die Nicescroll jQuery-Bibliothek in Deine WordPress-basierte Website.

source: This plugin is a wrapper for the popular "Nicescroll" javascript library, which is made by <a href="https://wordpress.org/support/users/inuyaksa/" target="_blank">InuYaksa</a>.
de_de: Dieses Plugin ist ein Wrapper für die beliebte Javascript-Bibliothek "Nicescroll", die von <a href="https://wordpress.org/support/users/inuyaksa/" target="_blank">InuYaksa erstellt wurde</a> .

source: You can visit his official Nicescroll homepage <a href="https://www.areaaperta.com/nicescroll/" target="_blank">here</a>.
de_de: Sie können seine offizielle Nicescroll Homepage <a href="https://www.areaaperta.com/nicescroll/" target="_blank">hier</a> besuchen.

source: An overview of the default parameters can be found on <a href="https://github.com/inuyaksa/jquery.nicescroll" target="_blank">Github</a> at the bottom of the page.
de_de: Eine Übersicht der Standardparameter finden Sie auf <a href="https://github.com/inuyaksa/jquery.nicescroll" target="_blank">Github</a> am unteren Rand der Seite.

source: For help regarding 'Nicescroll', please refer to the official <a href='https://areaaperta.com/nicescroll/' target='_blank'>Nicescroll</a> website.
de_de: Hilfe zu "Nicescroll" finden Sie auf der offiziellen <a href='https://areaaperta.com/nicescroll/' target='_blank'>Nicescroll-Website</a>.

source: There are also optional 'back to top' buttons for both frontend and backend, which may come in handy. If your theme gets shipped with this functionality already, you can disable the plugin's integrated feature on the 'Plugin' settings page.
de_de: Es gibt auch optionale 'Nach oben'-Buttons für das Frontend und das Backend, was sich als nützlich erweisen kann. Wenn Ihr Theme bereits mit dieser Funktion ausgeliefert wird, können Sie die integrierte Funktion des Plugins auf der entsprechenden Seite deaktivieren.

source: If you have any questions, comments or issues regarding 'Nicescrollr', please visit the <a href='https://wordpress.org/plugins/nicescrollr/' target='_blank'>Nicescrollr</a> plugin homepage.
de_de: Wenn Sie Fragen, Kommentare oder Probleme bezüglich 'Nicescrollr' haben, besuchen Sie bitte die <a href='https://wordpress.org/plugins/nicescrollr/' target='_blank'>Nicescrollr-</a> Plugin-Startseite.

source: Use Nicescroll
de_de: Nicescroll verwenden

source: Enable or disable Nicescroll.
de_de: Nicescroll aktivieren oder deaktivieren.

source: Choose cursor color.
de_de: Cursorfarbe wählen.

source: Your input didn't pass validation. This value must be a hexadecimal color value. It was reset to its default. To customize it, please input a color value like '#fff' or '#0073AA'.
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss ein hexadezimaler Farbwert sein. Er wurde mit dem Standardwert belegt. Um die Farbe an zu passen, geben Sie bitte einen Wert à la "#FFF" oder "#0073AA" ein.

source: Set opacity for when the cursor is inactive.
de_de: Transparenz bei inaktivem Cursor wählen.

source: Your input didn't pass validation. This value must be a positive number between 0 and 1, with max two decimal places (or left blank).
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss positiv sein und zwischen 0 (Null) und 1 liegen, und er darf bis zu zwei Nachkommastellen beinhalten (oder Feld leer lassen).

source: Set opacity for when the cursor is active.
de_de: Transparenz bei aktivem Cursor wählen.

source: Your input didn't pass validation. This value must be a positive number between 0 and 1, with max two decimal places. It was reset to it's default.
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss positiv sein und zwischen 0 (Null) und 1 liegen, und er darf bis zu zwei Nachkommastellen beinhalten. Der Wert wurde auf seinen Standardwert zurückgesetzt.

source: Set cursor width (in pixel).
de_de: Cursorbreite wählen (in Pixel).

source: Your input didn't pass validation. This value must be a positive, integer pixel value including 0 (zero). It was reset to it's default.
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss ein positiver, ganzzahliger Wert inklusive 0 (Null) sein. Er wurde mit dem Standardwert belegt.

source: Set cursor border width (in pixel).
de_de: Cursorrahmenbreite wählen (in Pixel).

source: Select cursor border state.
de_de: Anzeigeart des Cursorrahmens wählen.

source: none
de_de: keine

source: Set cursor border color.
de_de: Cursorrahmenfarbe wählen.

source: Your input didn't pass validation. This value must be a hexadecimal color value. (It was reset to its default.) To customize it, please input a color value like '#fff' or '#0073AA'.
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss ein hexadezimaler Farbwert sein. Er wurde mit dem Standardwert belegt. Um die Farbe an zu passen, geben Sie bitte einen Wert à la "#FFF" oder "#0073AA" ein.

source: Set cursor border radius (in pixel).
de_de: Radius des Cursorrahmens wählen (in Pixel).

source: Your input didn't pass validation. This value must be a positive, integer pixel value or left blank. It was reset to it's default.
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss ein positiver, ganzzahliger Wert inklusive 0 (Null) sein. Er wurde mit dem Standardwert belegt.

source: Change the background color of the rail, or leave it blank.
de_de: Ändern der Hintergrundfarbe der Scrollleiste.

source: Set scrolling speed.
de_de: Scrollgeschwindigkeit einstellen.

source: Your input didn't pass validation. This value must be a positive integer but must not be 0 (zero). To aviod unwanted scrolling behaviour, the scrollspeed was reset to its default. (Note: If you intended to disable the mousewheel, please visit the extended settings panel.)
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss ein positiver, ganzzahliger Wert sein, und er darf nicht 0 (Null) betragen. Der Wert wurde auf den Standardwert zurückgesetzt.

source: Set scrolling speed for the mousewheel.
de_de: Scrollgeschwindigkeit des Mausrades einstellen.

source: Your input didn't pass validation. This value must be a positive integer but it must not be 0 (zero). To aviod unwanted scrolling behaviour, it was reset to its default.
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss ein positiver, ganzzahliger Wert sein, und er darf nicht 0 (Null) betragen. Der Wert wurde auf den Standardwert zurückgesetzt.

source: Select auto-hide mode.
de_de: Automatisches Verbergen einstellen.

source: enabled
de_de: ein

source: disabled
de_de: aus

source: Show Default Scrollbar
de_de: Standard-Scrollbar anzeigen

source: Use the browsers default scrollbar look.
de_de: Das Standard-Design der Scrollbar verwenden.

source: Enable On Mobile Devices
de_de: Auf mobilen Endgeräten anzeigen

source: Enable or disable Nicescroll on mobile devices. This will only work if Nicescroll is enabled.
de_de: Aktivieren oder deaktivieren Sie Nicescroll auf mobilen Geräten. Dies funktioniert nur, wenn Nicescroll aktiviert ist.

source: Set z-index.
de_de: Z-Index wählen.

source: Your input didn't pass validation. This value must be an integer value. It was reset to it's default.
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss ein ganzzahliger Wert inklusive 0 (Null) sein. Er wurde mit dem Standardwert belegt.

source: Emulate Touch
de_de: “Touch” emulieren.

source: Enable cursor-drag scrolling like touch devices in desktop computer.
de_de: Aktivieren Sie das Cursor-Ziehen wie bei Touch-Geräten auf einem Desktop-Computer.

source: Switch hardware acceleration on or off.
de_de: Hardware-Beschleunigung ein- oder ausschalten.

source: Enable zoom for box content.
de_de: Box-Inhalte zoomen.

source: Zoom activated when double click on box ("Box Zoom" must be "on").
de_de: Zoom bei Doppelklick auf Box (erfordert "Box Zoom").

source: Zoom on pitch in/out on box (For touch devices, set "Box Zoom" on).
de_de: Zoom durch Geste für Touch-Devices (erfordert "Box Zoom").

source: Display "grab" icon ("Touch Behavior" must be possible and "on").
de_de: Packen des Cursors auf Touch-Devices erleichtern.

source: Switch auto-resize for iFrames on or off.
de_de: Automatische Grössenänderung für iFrames ein- oder ausschalten.

source: Set the minimum cursor height.
de_de: Mindesthöhe des Cursors einstellen.

source: Your input didn't pass validation. This value must be a positive integer including 0 (zero). It was reset to it's default.
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss ein positiver, ganzzahliger Wert inklusive 0 (Null) sein. Er wurde mit dem Standardwert belegt.

source: Scroll native scrollable areas with mouse.
de_de: Scrollbare Bereiche mit Nicescroll scrollen.

source: Add offset for rail position or disable it.
de_de: Aussenabstand der Cursorleiste wählen oder deaktivieren.

source: off
de_de: aus

source: Mobile-like scroll bouncing at the end of content.
de_de: Federndes Scrollverhalten bei Inhaltsende.

source: Page down-scrolling with the spacebar.
de_de: Runterscrollen via Leertaste.

source: Set rail padding top.
de_de: Innenabstand oben zum Cursor hin wählen.

source: Your input didn't pass validation. This value must be a positive integer including 0 (zero) or left blank.
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss ein positiver, ganzzahliger Wert inklusive 0 (Null) sein (oder Feld leer lassen).

source: Set rail padding right.
de_de: Innenabstand rechts zum Cursor hin wählen.

source: Set rail padding bottom.
de_de: Innenabstand unten zum Cursor hin wählen.

source: Set rail padding left.
de_de: Innenabstand links zum Cursor hin wählen.

source: For chrome browser, disable outline.
de_de: "Kontur verbergen" (für Chrome Browser).

source: Let Nicescroll manage horizontal scrolling.
de_de: Horizontales Scrollen mittels Nicescroll.

source: Select alignment of horizontal rail.
de_de: Ausrichtung horizontale Cursorleiste.

source: right
de_de: rechts

source: left
de_de: links

source: Select alignment of vertical rail.
de_de: Ausrichtung vertikale Cursorleiste.

source: bottom
de_de: unten

source: top
de_de: oben

source: Switch translate3d on or off.
de_de: Translate3D ein- oder ausschalten.

source: Let Nicescroll manage mousewheel events.
de_de: Mausrad-Events durch Nicescroll steuern lassen.

source: Let Nicescroll manage keyboard events.
de_de: Keyboard-Events durch Nicescroll steuern lassen.

source: Scroll with ease movement.
de_de: "Sanftes" Scrollverhalten ein- oder ausschalten.

source: Scrolling trough click on rail.
de_de: Scrollen durch Klick auf die Cursorleiste.

source: extended
de_de: erweitert

source: Select cursor fixed height or disable it.
de_de: Feste Cursorhöhe einstellen oder deaktivieren.

source: Choose dead zone (in pixel) for direction lock activation.
de_de: "Totzone" für Scroll-Richtungswechsel (in Pixel).

source: Your input didn't pass validation. This value must be a positive integer including 0 (zero) or left blank. To customize it, please have a look at its placeholder.
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss ein positiver, ganzzahliger Wert inklusive 0 (Null) sein (oder Feld leer lassen).

source: Delay in miliseconds for fading out the scrollbar.
de_de: Verzögerungszeit für das automatische Verbergen der Scrollleiste (in Milisekunden).

source: Your input didn't pass validation. This value must be a positive integer including 0 (zero) or left blank. It represents the delay in miliseconds.
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss ein positiver, ganzzahliger Wert inklusive 0 (Null) sein (oder Feld leer lassen).

source: Detect bottom of content and let parent scroll, as native scroll does.
de_de: Scrollen bei Inhaltsende gemäss Browservoreinstellung.

source: Auto-scrolling of content while selecting text.
de_de: Automatisches Scrollen beim markieren von langen Textabschnitten.

source: Choose the momentum on cursor drag.
de_de: Das "Drehmoment" für das Ziehen des Cursors einstellen.

source: Your input didn't pass validation. This value must be a positive number with max two decimal places or left blank. Please review its placeholder.
de_de: Die Eingabe konnte nicht erfolgreich validiert werden. Dieser Wert muss null (0) oder positiv mit maximal zwei Nachkommastellen sein ( oder Feld leer lassen).

source: Enable or disable rtl-mode.
de_de: RTL-Modus ein- oder ausschalten.

source: Enable or disable cursor drag on touch.
de_de: Cursor durch Berührung ziehen.

source: One Axis Mouse Mode
de_de: Ein-Achsen-Mausmodus

source: It permits horizontal scrolling with mousewheel on horizontal only content, if false (vertical-only) mousewheel don't scroll horizontally, if value is auto detects two-axis mouse.
de_de: Erlaubt das horizontale Scrollen mit dem Mausrad nur bei horizontalem Inhalt, wenn das Mausrad nicht (nur vertikal) horizontal blättert, wenn der Wert automatisch die zweiachsige Maus erkennt.

source: Prevent Multitouch Scrolling
de_de: Multitouch-Scrolling verhindern

source: Prevent scrolling on multitouch events.
de_de: Scrollen bei Multitouch-Events verhindern.

source: Disable Mutation Observer
de_de: Mutationobserver deaktivieren

source: Force MutationObserver disabled.
de_de: Mutationobserver deaktivieren erzwingen.

source: Enable Observer
de_de: Mutationobserver aktivieren

source: Enable DOM changing observer, it tries to resize/hide/show when parent or content div had changed.
de_de: Aktivieren Sie den DOM-Änderungsbeobachter. Er versucht, die Scrollbar an Längenänderungen des Dokuments an zu passen, um ein einwandfreies Scrollerlebnis aufrecht zu erhalten.

source: Set a custom ID for nicescroll bars.
de_de: Benutzerdefinierte ID für die Nicescroll-Scrollbar festlegen.

source: Your input didn't pass validation. Do not enter '#'. The name must look somthing like 'nice_scrollbar', 'my-cool-div', 'scrollbar123' etc. It was reset to it\'s default value.
de_de: Ihre Eingabe hat die Validierung nicht bestanden. Betreten verboten '#'. Der Name muss wie "nice_scrollbar", "my-cool-div", "scrollbar123" usw. aussehen. Er wurde auf den Standardwert zurückgesetzt.

source: BackTop Button
de_de: Nach-Oben-Schaltfläche

source: Enable backtop.
de_de: Backtop aktivieren.

source: BackTop On Mobile Devices
de_de: "Nach-Oben-Button" auf mobilen Endgeräten

source: Enable backtop button on mobile devices.
de_de: "Nach-Oben-Button" auf mobilen Endgeräten anzeigen.

source: Button Size
de_de: Button-Größe

source: Set button size.
de_de: Button-Grösse festlegen.

source: small
de_de: klein

source: medium
de_de: mittel

source: default
de_de: standard

source: large
de_de: gross

source: Arrow Color
de_de: Pfeil-Farbe

source: Set arrow color.
de_de: Pfeil-Farbe festlegen.

source: Arrow Hover Color
de_de: Pfeil-Farbe (hover)

source: Set arrow hover color.
de_de: Pfeil-Farbe festlegen (hover).

source: Background Color
de_de: Hintergrundfarbe

source: Set background color.
de_de: Hintergrundfarbe festlegen.

source: Hover Background Color
de_de: Hintergrundfarbe bei "hover"

source: Border Color
de_de: Rahmenfarbe

source: Set border color.
de_de: Rahmenfarbe festlegen.

source: Hover Border Color
de_de: Rahmenfarbe bei "hover"

source: Border Width
de_de: Rahmenbreite

source: Set border width in pixels.
de_de: Rahmenbreite in Pixel festlegen.

source: Border Style
de_de: Rahmenstil

source: Set border style.
de_de: Rahmen-Stil festlegen.

source: Position From Right
de_de: Position von rechts aus

source: Set button position from right in pixels.
de_de: Schaltflächenposition in Pixeln von rechts aus festlegen.

source: Position From Bottom
de_de: Position von unten aus

source: Set button position from bottom in pixels.
de_de: Schaltflächenposition in Pixeln von unten aus festlegen.

source: Border Radius Top Left
de_de: Rahmenradius oben links

source: Set border radius top left in pixels or percent.
de_de: Setzen Sie den Rahmenradius oben links in Pixel oder Prozent.

source: Your input didn't pass validation. This value must be a positive, integer pixel- or percent- value including 0 (zero). It was reset to it's default.
de_de: Ihre Eingabe hat die Validierung nicht bestanden. Dieser Wert muss ein positiver, ganzzahliger Pixel- oder Prozentwert sein, einschließlich 0 (Null). Es wurde auf den Standard zurückgesetzt.

source: Border Radius Top Right
de_de: Rahmenradius oben rechts

source: Set border radius top right in pixels or percent.
de_de: Setzen Sie den Rahmenradius in Pixel oder Prozent oben rechts.

source: Border Radius Bottom Left
de_de: Rahmen Radius unten links

source: Set border radius bottom left in pixels or percent.
de_de: Legen Sie den Rahmenradius unten links in Pixel oder Prozent fest.

source: Border Radius Bottom Right
de_de: Rahmenradius unten rechts

source: Set border radius bottom right in pixels or percent.
de_de: Setzen Sie den Rahmenradius unten rechts in Pixel oder Prozent.

source: Failed resetting the settings. Please refresh the page and try again.
de_de: Die Einstellungen konnten nicht zurückgesetzt werden. Bitte laden Sie die Seite neu und versuchen Sie es erneut.

source: Basic Settings
de_de: Grundlegende Einstellungen

source: Extended Settings
de_de: Erweiterte Einstellungen

source: BackTop Settings
de_de: BackTop-Einstellungen

source: Reset Settings
de_de: Einstellungen zurücksetzen

source: Reset Frontend
de_de: Frontend zurücksetzen

source: Resets the settings for the frontend.
de_de: Setzt die Frontend-Ansicht zurück.

source: Reset Backend
de_de: Backend zurücksetzen

source: Resets the settings for the backend.
de_de: Setzt die Backend-Ansicht zurück.

source: There is no section related to the data.
de_de: Keine Sektion definiert.

source: on
de_de: ein

source: Your input didn't pass validation. Please use numbers and/or alphabetical characters.
de_de: Ihre Eingabe hat die Validierung nicht bestanden. Bitte verwenden Sie Zahlen und / oder Buchstaben.

source: false
de_de: aus

source: One more try and your browser will burst into flames ;-)
de_de: Du kommst hier net rein...

source: All done! Please refresh the page for the settings to take effect.
de_de: Alles erledigt! Aktualisieren Sie bitte die Seite, damit die Einstellungen wirksam werden.

source: Couldn't reset the settings. Please try again.
de_de: Die Einstellungen konnten nicht zurückgesetzt werden. Bitte versuchen Sie es erneut.s
